; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=44, out_folder=htg/blocksworld/training, instance_id=24, seed=2048, goal_proportion=0.1

(define (problem blocksworld-24)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 b40 b41 b42 b43 b44 - object)
 (:init 
    (arm-empty)
    (clear b28)
    (on-table b28)
    (clear b24)
    (on-table b24)
    (clear b38)
    (on-table b38)
    (clear b17)
    (on b17 b13)
    (on b13 b2)
    (on-table b2)
    (clear b40)
    (on b40 b26)
    (on-table b26)
    (clear b43)
    (on b43 b11)
    (on b11 b12)
    (on-table b12)
    (clear b30)
    (on-table b30)
    (clear b33)
    (on b33 b36)
    (on-table b36)
    (clear b18)
    (on-table b18)
    (clear b41)
    (on b41 b5)
    (on-table b5)
    (clear b44)
    (on-table b44)
    (clear b4)
    (on b4 b31)
    (on b31 b15)
    (on b15 b10)
    (on b10 b37)
    (on b37 b14)
    (on-table b14)
    (clear b20)
    (on b20 b29)
    (on-table b29)
    (clear b35)
    (on b35 b27)
    (on b27 b7)
    (on b7 b39)
    (on b39 b21)
    (on b21 b6)
    (on b6 b9)
    (on b9 b3)
    (on b3 b8)
    (on b8 b1)
    (on b1 b22)
    (on b22 b16)
    (on-table b16)
    (clear b23)
    (on-table b23)
    (clear b42)
    (on b42 b25)
    (on-table b25)
    (clear b34)
    (on-table b34)
    (clear b32)
    (on b32 b19)
    (on-table b19))
 (:goal  (and 
    (clear b1)
    (on-table b1)
    (clear b4)
    (on b4 b2)
    (on b2 b3)
    (on-table b3))))

; plan
1. (unstack b17 b13)
   deleted: (on b17 b13) (clear b17) (arm-empty)
   added: (holding b17) (clear b13)
   goals met: 1 of 6
2. (putdown b17)
   deleted: (holding b17)
   added: (clear b17) (arm-empty) (on-table b17)
   goals met: 1 of 6
3. (unstack b13 b2)
   deleted: (on b13 b2) (clear b13) (arm-empty)
   added: (holding b13) (clear b2)
   goals met: 1 of 6
4. (putdown b13)
   deleted: (holding b13)
   added: (clear b13) (arm-empty) (on-table b13)
   goals met: 1 of 6
5. (unstack b4 b31)
   deleted: (on b4 b31) (clear b4) (arm-empty)
   added: (holding b4) (clear b31)
   goals met: 0 of 6
6. (stack b4 b2)
   deleted: (clear b2) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b2)
   goals met: 2 of 6
7. (unstack b35 b27)
   deleted: (on b35 b27) (clear b35) (arm-empty)
   added: (holding b35) (clear b27)
   goals met: 2 of 6
8. (putdown b35)
   deleted: (holding b35)
   added: (clear b35) (arm-empty) (on-table b35)
   goals met: 2 of 6
9. (unstack b27 b7)
   deleted: (on b27 b7) (clear b27) (arm-empty)
   added: (holding b27) (clear b7)
   goals met: 2 of 6
10. (putdown b27)
   deleted: (holding b27)
   added: (clear b27) (arm-empty) (on-table b27)
   goals met: 2 of 6
11. (unstack b7 b39)
   deleted: (on b7 b39) (clear b7) (arm-empty)
   added: (holding b7) (clear b39)
   goals met: 2 of 6
12. (putdown b7)
   deleted: (holding b7)
   added: (clear b7) (arm-empty) (on-table b7)
   goals met: 2 of 6
13. (unstack b39 b21)
   deleted: (on b39 b21) (clear b39) (arm-empty)
   added: (holding b39) (clear b21)
   goals met: 2 of 6
14. (putdown b39)
   deleted: (holding b39)
   added: (clear b39) (arm-empty) (on-table b39)
   goals met: 2 of 6
15. (unstack b21 b6)
   deleted: (on b21 b6) (clear b21) (arm-empty)
   added: (holding b21) (clear b6)
   goals met: 2 of 6
16. (putdown b21)
   deleted: (holding b21)
   added: (clear b21) (arm-empty) (on-table b21)
   goals met: 2 of 6
17. (unstack b6 b9)
   deleted: (on b6 b9) (clear b6) (arm-empty)
   added: (holding b6) (clear b9)
   goals met: 2 of 6
18. (putdown b6)
   deleted: (holding b6)
   added: (clear b6) (arm-empty) (on-table b6)
   goals met: 2 of 6
19. (unstack b9 b3)
   deleted: (on b9 b3) (clear b9) (arm-empty)
   added: (holding b9) (clear b3)
   goals met: 2 of 6
20. (putdown b9)
   deleted: (holding b9)
   added: (clear b9) (arm-empty) (on-table b9)
   goals met: 2 of 6
21. (unstack b3 b8)
   deleted: (on b3 b8) (clear b3) (arm-empty)
   added: (holding b3) (clear b8)
   goals met: 2 of 6
22. (putdown b3)
   deleted: (holding b3)
   added: (clear b3) (arm-empty) (on-table b3)
   goals met: 3 of 6
23. (unstack b8 b1)
   deleted: (on b8 b1) (clear b8) (arm-empty)
   added: (holding b8) (clear b1)
   goals met: 4 of 6
24. (putdown b8)
   deleted: (holding b8)
   added: (clear b8) (arm-empty) (on-table b8)
   goals met: 4 of 6
25. (unstack b1 b22)
   deleted: (on b1 b22) (clear b1) (arm-empty)
   added: (holding b1) (clear b22)
   goals met: 3 of 6
26. (putdown b1)
   deleted: (holding b1)
   added: (clear b1) (arm-empty) (on-table b1)
   goals met: 5 of 6
27. (unstack b4 b2)
   deleted: (on b4 b2) (clear b4) (arm-empty)
   added: (holding b4) (clear b2)
   goals met: 3 of 6
28. (putdown b4)
   deleted: (holding b4)
   added: (clear b4) (arm-empty) (on-table b4)
   goals met: 4 of 6
29. (pickup b2)
   deleted: (clear b2) (on-table b2) (arm-empty)
   added: (holding b2)
   goals met: 4 of 6
30. (stack b2 b3)
   deleted: (clear b3) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b3)
   goals met: 5 of 6
31. (pickup b4)
   deleted: (clear b4) (on-table b4) (arm-empty)
   added: (holding b4)
   goals met: 4 of 6
32. (stack b4 b2)
   deleted: (clear b2) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b2)
   goals met: 6 of 6
